# # c = [1,2,
# #      3,4,
# #      5,6,
# #      7,8,9,10]  #换行不会自动写\
# # print(c)
#
# strcy = 's' \
#         'aasf' \
#         'af'    #换行会自动写\
# print(strcy)    #saasfaf
#
#
"""
常量
"""
# BI = 3.1415926 #大写约定俗成为常量，其实不是常量
#
# print('\n向下取余', 2//4)   #向下取余 0 #得到整数
# print('除法运算', 2/4)  #除法运算 0.5   #得到浮点数
#
# #切片 [开始:结尾] 取左不取右
# name = "小仙女是正宗大肥猪"
# print(len(name))
# print(name[0:3])
# print(name[0:6:2])  #步长0+2=2，2+2=4
# print(name[-9:-1])  #小仙女是正宗大肥
# print(name[-9:-1:2])
# print(name[-9:-1:3])
#
# #注意：[::-1]反转字符串
# print(name[::-1])
#
"""
# 字符串的拼接
"""
# a = '伟大'+'恶臭'
# print(a)
#
# a = 'sss'
# b = 'aaa'
# c = 'bbb'
# f = ','.join((a,b,c))   #在字符串末尾添加字符#注意；有两个括号    #f = ','.join((a,b,c))   #在字符串末尾添加字符#注意；有两个括号    #
# print(f)
#
"""
#     字符串的格式化{}
#     format()
"""
# print("这里是肉芽馆,是魅魔小猫咪")
# print("c".format("肉芽馆",'魅魔小猫咪'))    #这里是肉芽馆,是魅魔小猫咪
#
# s1 = "这里是{},我是{}哦"
# s1.format("肉芽馆","贫乳小萝莉")
# print(s1)   #这里是{},我是{}哦
# print(s1.format("肉芽馆","贫乳小萝莉")) #这里是肉芽馆,我是贫乳小萝莉哦
# # s2  = '这里是{0},我是{1}哦'
# # print(s1.format(0=="肉芽馆",1=="贫乳小萝莉")) #不对
#
"""
#     find 查找
#     count 统计字符串片段，在字符串中出现的次数
"""
# fi = 'abcagb'
# print(fi.find("g"))
# print(fi.find("a")) #0  返回的是字符串中第一个a
# print(fi.find("a",1,5)) #下标
# #注意：找不到返回-1
# print(fi.find('x')) #-1
#
# print(fi.count('a'))    #2
# print(fi.count('a',1,5))    #1




"""
字符串常用方法：
    replace 替换
        参1：要替换的
        参2：替换后的
        参3：替换的次数，从左往右（默认替换所有）
    upper:将小写字母转为大写(全部）
    lower:将大写字母转成小写(全部）
"""
# fi = '是rabaq(rbq)啦'
#
# print(fi.replace('a','魅魔')) #是r魅魔b魅魔q(rbq)啦
# fi_1 = fi.replace('a','萝莉魅魔',1)
# print(fi_1) #是r萝莉魅魔baq(rbq)啦
#
# fi_2 = fi.upper()   #是RABAQ(RBQ)啦
# print(fi_2)
#
# fi_3 = fi_2.lower()
# print(fi_3)


"""
注意：' '-空格 ''-空
字符串的方法；
    split 指定分割点对字符串进行分割,得到一个列表
        参1 分割点
        参2 分割的次数(默认所有的)
    strip 去除出字符串首尾的相应字符 #无参，去空格；有1个参，去参
          #注意：只能去除首尾的相应的字符
          要想去除中间的只能使用替换，.replace(' ','')>>-参1-空格，参2-空
"""

# fi = "   哼，"
# fi2 = 'rbq哼，rbq'
# fi3 = "    可爱的粉红色    晕染着少女的肌肤    "
# fi1 = "别以为这样#"
# oc = '调教了一顿果然老实了'
#
# fi_o = fi.strip()   #哼，
# print(fi_o)
# fi_o1 = fi2.strip('rbq')    #哼， #去除了rbq
# print(fi_o1)
# fi3_o = fi3.strip()   #可爱的粉红色    晕染着少女的肌肤 #只去了首尾
# print(fi3_o)
# fi3_o1 = fi3.replace(' ','')    #可爱的粉红色晕染着少女的肌肤
# print(fi3_o1)
#
#
# fi1_o1 = fi1.split()    #['别以为这样#']
# print(fi1_o1)
#
# oc_o1 = oc.split('了')    #['调教', '一顿果然老实', '']
# print(oc_o1)

# oc_o12= oc.split('了',1)    #['调教', '一顿果然老实了']   #分割了一次
# print(oc_o12)



"""
传统的格式化输出占位方法：%
    %s 为字符占位
    %d 为数值类型占位
    %f 为浮点数占位
    
    F表达式（python3.6之后才能用）
        master = '章鱼'
        pet = '龙王'
        ff1 = '这样说着，{}站起来，将{}提起，随后放进了衣柜'\
        .format(master,pet) #这样说着，章鱼站起来，将龙王提起，随后放进了衣柜
        print(ff1)
        
        master_1 = '章鱼'
        pet_1 = '魅魔雌小鬼龙王'
        ff2 = F'这样说着，{master_1}站起来，将{pet_1}提起，随后放进了衣柜'  #这样说着，章鱼站起来，将魅魔雌小鬼龙王提起，随后放进了衣柜
        print(ff2)
"""
# s1  = '%s被群员固定在墙上'%('龙王')   #%s-用来占位
# s2 = '娇小的身子被皮带勒出%s道道红痕'%(100)
# s3 = '调教%s顿果然老实了'%([1,100])
# print(s1)   #龙王被群员固定在墙上
# print(s2)   #娇小的身子被皮带勒出100道道红痕
# print(s3)   #调教[1, 100]顿果然老实了
#
# d1 = '群员将手里的遥控器档位调至%d'%(9)
# d2 = '群员将手里的遥控器档位调至最大%d'%(9.8)
# print(d1)
# print(d2)   #群员将手里的遥控器档位调至最大9   #%d会对浮点数取整
#
# f1 = '%f丝液体从奶瓶渗出'%(100.314) #100.314000丝液体从奶瓶渗出
# f2 = '%f丝液体从奶瓶渗出'%(100) #100.000000丝液体从奶瓶渗出 #%f整数变浮点数
# print(f1)
# print(f2)
#
#
# master = '章鱼'
# pet = '龙王'
# ff1 = '这样说着，{}站起来，将{}提起，随后放进了衣柜'\
#     .format(master,pet) #这样说着，章鱼站起来，将龙王提起，随后放进了衣柜
# print(ff1)
#
# master_1 = '章鱼'
# pet_1 = '魅魔雌小鬼龙王'
# ff2 = F'这样说着，{master_1}站起来，将{pet_1}提起，随后放进了衣柜'  #这样说着，章鱼站起来，将魅魔雌小鬼龙王提起，随后放进了衣柜
# print(ff2)
#
# ff3 = f'这样说着，{master}站起来，将{pet}提起，随后放进了衣柜'  #这样说着，章鱼站起来，将龙王提起，随后放进了衣柜
# print(ff3)

"""
len() 字符串长度
format 格式化输出（进阶)>>-format参数-下标
    1.  :.2f 四舍五入保留2位小数
        {:.2f}>>-四舍五入保留两位小数 #第一个参数是下标，第二个参数是四舍五入几位小数
            fff = 12.1234567
            print('再来{:.2f}次，我可以的'.format(fff)) #
            
            
        fff = 12.1234567
        sss = 5
        print('{0:.2f}根一起，我可以的'.format(fff,sss))    #12.12根一起，我可以的   #选第0个参数
        print('{1:.2f}根一起，我可以的'.format(fff,sss))    #5根一起，我可以的   #选第1个参数
    2.  .2% 百分比形式显示小数
            x = 0.5
            print('满足度{:.2%}'.format(x))    #满足度50.00%  #.2指百分之保留几位小数
            print('满足度{:.5%}'.format(x))    #满足度50.00%
"""

master_1 = '章鱼'
master_2 = '   章鱼'
pet_1 = '魅魔雌小鬼龙王'
print(len(master_1))    #2
print(len(master_2))    #5


fff = 12.1234567
print(fff)  #12.1234567
print('再来{}次，我可以的'.format(fff)) #再来12.1234567次，我可以的
print('再来{:.2f}次，我可以的'.format(fff)) #再来12.12次，我可以的  #:.2f>>-四舍五入留两位小数

sss = 5
print('{0:.2f}根一起，我可以的'.format(fff,sss))    #12.12根一起，我可以的   #选第0个参数
print('{1:.2f}根一起，我可以的'.format(fff,sss))    #5根一起，我可以的   #选第1个参数


x = 0.5
print('满足度{:.2%}'.format(x))    #满足度50.00%  #.2指百分之保留几位小数
print('满足度{:.5%}'.format(x))    #满足度50.00%