import numpy as np
a = np.array([2,3,4])   #一维数组[2 3 4]
b = np.array([[1,2,3],[6,7,8]])
# [[1 2 3]   矩阵两行三列
# [6 7 8]]
c = np.array([[23,34,45],[1,2,9],[123,345,12345]])
# [[   23    34    45]  #三行三列
#  [    1     2     9]
#  [  123   345 12345]]

print(a)
print(b)
print(c)

print('------三维数组')
san = np.array([[[1,23,4],[4,5,6]]])    #三维数组
print(san)

print('---------zero----------')
#0矩阵
zeros = np.zeros((2,5), np.uint8)
print(zeros)
# [[0 0 0 0 0]  #两行五列
#  [0 0 0 0 0]]
print('---1')
zeros_1 = np.zeros(5, np.uint8)
#[0 0 0 0 0] 一行五列
print(zeros_1)
print('---2')
#opencv中是行的个数，列的个数，层数(通道数）
zeros_2 = np.zeros((5,8,3), np.uint8)   #打印出了5个8行3列和opencv不同
print(zeros_2)

print('--------ones--------')
#1矩阵
ones = np.ones((3,8), np.uint8) #三行八列
print(ones)
# [[1 1 1 1 1 1 1 1]
#  [1 1 1 1 1 1 1 1]
#  [1 1 1 1 1 1 1 1]]

print('---1')
ones_1 = np.ones(8, np.uint8)   #一行八列
print(ones_1)
# [1 1 1 1 1 1 1 1]

#full矩阵
full_1 = np.full((3,8), 11, np.uint8)   #三行八列
print(full_1)
# [[11 11 11 11 11 11 11 11]
#  [11 11 11 11 11 11 11 11]
#  [11 11 11 11 11 11 11 11]]


#identity 单位矩阵
dan = np.identity(3)    #左上至右下角1，其他0
print(dan)
# [[1. 0. 0.]
#  [0. 1. 0.]
#  [0. 0. 1.]]

dan_1= np.eye(5, 7) #5行7列
print(dan_1)
# [[1. 0. 0. 0. 0. 0. 0.]
#  [0. 1. 0. 0. 0. 0. 0.]
#  [0. 0. 1. 0. 0. 0. 0.]
#  [0. 0. 0. 1. 0. 0. 0.]
#  [0. 0. 0. 0. 1. 0. 0.]]

dan_3 = np.eye(5,7,k=2)
print(dan_3)
# [[0. 0. 1. 0. 0. 0. 0.]   #从第一行下标2开始，左上至右下为1，其他0
#  [0. 0. 0. 1. 0. 0. 0.]
#  [0. 0. 0. 0. 1. 0. 0.]
#  [0. 0. 0. 0. 0. 1. 0.]
#  [0. 0. 0. 0. 0. 0. 1.]]
