"""
集合(set):一般用于元组或者列表中的元素去重，集合默认去重
注意：集合使用的是{}

1.无序的不可重复的元素序列
2.集合中元素不重复
3.变量= {}       #可数字，字符串，元组
  变量=  set()   #可字符串，列表，元组，字典
    字典只能打印键

"""

# a = {(1,2,34),'2',1,} #{1, 2, 3, 4, 5}
# print(a)
#
# b = set((1,23))    #元组不可以和其他的一起 #{1, 23}
# print(b)
# b = set([1,23])    #列表不可以和其他的一起 #{1, 23}
# print(b)
# b = set({1:1,23:10})    #列表不可以和其他的一起 #{1, 23}   #只能打印键
# print(b)               #字典{1, 23}
#
#
# #列表的去重
# c = set([1,1,1,45,6])   #{1, 45, 6}
# print(c)
# #元组的去重
# cc = set((1,23,233,23,1))
# print(cc)
# #字典的去重
# ccc = set({1:23,1:345,5:'af'})  #{1, 5} #字典去重是对键的操作
# print(ccc)
# #字符串去重
# cccc = set('s wf sss')  #{'s', 'f', 'w', ' '}
# print(cccc)
#
# ccccc = set('s wf sssa')  #{'s', 'f', 'w', ' '}
# print(ccccc)


"""
集合中添加元素的方法
    1.add 数字 字符串 元组 一次只能添加一個
    2.update 将集合合并
"""

a = {1,2,3}
a.add(1234) #{1, 2, 3, 1234}    #只能添加一個
a.add('sss')
a.add((1,23,"faf"))
print(a)

b = {'s',1}
a.update(b) #{1, 2, 3, (1, 23, 'faf'), 1234, 'sss', 's'}
print(a)

c = set([1,3,'2'])
a.update(c) #{1, 2, 3, 'sss', '2', 's', 1234, (1, 23, 'faf')}
print(a)



"""
集合删除元素的方法：
    1.remove 删除没有的会报错
    2.discard 删除没有的不会报错
    3.pop随机删除
"""
a.remove('2')   #{1, 2, 3, 'sss', (1, 23, 'faf'), 1234, 's'}
print(a)
a.pop()
print(a)    #{2, 3, 1234, (1, 23, 'faf'), 's', 'sss'}   #随机删除
a.discard('sss')    #{2, 3, (1, 23, 'faf'), 's', 'sss', 1234}


"""
集合的交集和并集
    1.交集
        &得到相同的元素
    2.并集
        |得到不同的元素
"""

ce = {1,2,34,'ssf'}
ced = {1,2,34,'wei','遮掩'}
ou = ce & ced   #{1, 2, 34}
ous = ce | ced  #{1, 2, 'ssf', 34, 'wei', '遮掩'}
print(ou)
print(ous)